Repository: NathanBnm/workspaces
Catalog: po/extra/*.po
Languages: fr

source: Workspaces
fr: Espaces de travail

source: Workspaces to be always ready to work
fr: Espaces de travail pour être toujours prêt à travailler

source: Develop;Workspace;Launcher;
fr: Développement;Espace de travail;Lanceur;

source: Always be ready for work
fr: Toujours prêt pour travailler

source: Make working on different projects easy again!
fr: Rendez le travail sur différents projets de nouveau facile !

source: Workspaces lets you configure and quickly launch all you need to work on a project. It can open in a second different instances of code, a specific website and a directory
fr: Espaces de travail vous laisse configurer et lancer rapidement tout ce dont vous avez besoin pour un projet. L'application peut ouvrir une deuxième instance de code, un site Web spécifique et un dossier

source: Fixes
fr: Corrections

source: Fix run in terminal
fr: Correction de l'exécution dans le terminal

source: Fix Open quick launcher via the knob menu
fr: Correction de l'ouverture du lanceur rapide via le menu

source: Fix crash when clicking on link on about dialog by max246
fr: Correction d'un plantage lors du clic sur un lien dans la fenêtre à propos par max246

source: Close quick launcher when selecting an item, unless you press CTRL by Philip-Scott
fr: Fermeture du lanceur rapide lors de la sélection d'un élément, à moins que vous n'appuyiez sur Ctrl par Philip-Scott

source: Fixes visual issues on Switches, they were squashed
fr: Correction de problèmes graphiques sur les boutons

source: Improvements
fr: Améliorations

source: Save or don't save latest position by max246
fr: Enregistrement ou non de la dernière position de la fenêtre par max246

source: Make the workspaces in the left list sortables with drag and drop
fr: Les espaces de travail dans la liste de gauche sont désormais réorganisables par glisser-déposer

source: Make the items in the left list sortables with drag and drop
fr: Les éléments dans la liste de gauche sont désormais réorganisables par glisser-déposer

source: Items can be moved in another workspace just with drag and drop
fr: Les éléments peuvent être déplacés vers un autre espace de travail par un simple gliser-déposer

source: Workspaces are editable
fr: Les espaces de travail peuvent être modifiés

source: Workspaces are deletable (should display a warning message)
fr: Les espaces de travail peuvent être supprimés (devrait afficher un message d'avertissement)

source: Workspaces will display an image in the list, if they have one
fr: Les espaces de travail afficheront une image dans la liste, s'ils en possèdent une

source: Items now have a blue dot indicating that they are part of the auto-run
fr: Les éléments ont désormais un point bleu indiquant s'ils font partie d'une exécution automatique

source: Translations
fr: Traductions

source: German translation by meisenzahl
fr: Traduction en allemand par meisenzahl

source: Dutch Translation by Vistaus
fr: Traduction en néerlandais par Vistaus

source: Release 3.0 for AppCenter
fr: Version 3.0 pour le Centre d'Applications

source: Fixed typo
fr: Correction d'une faute d'orthographe

source: New Features
fr: Nouvelles fonctionnalités

source: Run commands in terminal
fr: Exécutez des commandes dans le terminal

source: App selection is now a popover
fr: Le sélecteur d'application est désormais une fenêtre flottante

source: Icon selection is now a popover
fr: Le sélecteur d'icône est désormais une fenêtre flottante

source: Quick launcher now has a better keyboard handling
fr: Le lanceur rapide a désormais une meilleure gestion des raccourcis clavier

source: Fixed theme for other gtk themes
fr: Correction du thème pour les autres thèmes GTK

source: Fixed icon critical message
fr: Correction de l'icône du message d'avertissement

source: Bug Fixes
fr: Corrections de bugs

source: Fixed shortcut for flatpak
fr: Correction du raccourci pour flatpak

source: Fixed load apps for flatpak
fr: Correction du chargement des applications pour flatpak

source: Features
fr: Fonctionnalités

source: Added default shortcut to launch the app and a way to modify it
fr: Ajout d'un raccourci par défaut pour lancer l'application et un moyen de le modifier

source: Add missing icons
fr: Ajout des icônes manquantes

source: Add URL type
fr: Ajout du type URL

source: Add Application type
fr: Ajout du type Application

source: Add Application + Directory type
fr: Ajout du type Application + Dossier

source: Add Directory type
fr: Ajout du type Dossier

source: Add Custom type
fr: Ajout du type Personnalisé

source: When closing preferences, if you were in the quick launcher, it will open back that one
fr: Lors de la fermeture, si vous étiez sur le lanceur rapide, il sera de nouveau ouvert

source: Improvementes
fr: Améliorations

source: Improved Icon
fr: Amélioration de l'icône

source: Set text color of the search icon on the header
fr: Définition de la couleur de texte de l'icône de recherche dans l'entête

source: Fix control file for deb packaging
fr: Correction du fichier de contrôle pour le paquet deb

source: Initial release
fr: Version initiale
